<a href="https://colab.research.google.com/github/ArjavMehta01/Truist-Credit_Risk_SAS/blob/Nishang/data_preparation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
test_data = pd.read_csv('/content/drive/My Drive/sample.csv')

In [0]:
mac = pd.read_csv('/content/drive/My Drive/summer project/MacroVariables_01.csv')

In [5]:
mac.head()

   HousingSt_Var        date  MDT_HS  ...  MDT_HPI  Payrolls  MDT_TNF
0           1600  01/01/2005   -19.0  ...    0.835    132791    123.0
1           1625  02/01/2005    68.0  ...    0.716    133050    147.0
2           1590  03/01/2005    25.0  ...    0.653    133172    259.0
3           1649  04/01/2005   -35.0  ...    0.607    133536    122.0
4           1605  05/01/2005    59.0  ...    0.542    133706    364.0

[5 rows x 11 columns]

In [0]:
test_data.head()

        Loan_id  Orig_rt  Orig_amt  ... Dlq_stat  Zb_code  Zb_date
0  100019404672    4.875    160000  ...        0      NaN      NaN
1  100019404672    4.875    160000  ...        0      NaN      NaN
2  100019404672    4.875    160000  ...        0      NaN      NaN
3  100019404672    4.875    160000  ...        0      NaN      NaN
4  100019404672    4.875    160000  ...        0      NaN      NaN

[5 rows x 14 columns]

In [6]:
# create sample data
Zb_code = np.ones(6)
for i in range(5):
  Zb_code[i]=None
test = [[1,1,1,2,2,2],
        ["3/1/2008","4/1/2008","5/1/2008","3/1/2008","4/1/2008","5/1/2008"],
        [0,1,2,3,4,999],
        Zb_code]
tran_test = np.transpose(test)
frame = pd.DataFrame(tran_test, columns = ['Loan_id', 'Act_date', 'Dlq_stat', 'Zb_code'])
print(frame)

  Loan_id  Act_date Dlq_stat Zb_code
0       1  3/1/2008        0     nan
1       1  4/1/2008        1     nan
2       1  5/1/2008        2     nan
3       2  3/1/2008        3     nan
4       2  4/1/2008        4     nan
5       2  5/1/2008      999     1.0

In [0]:
def generate_cur(Dlq_stat,Zb_code):
  if int(Dlq_stat) == 0:
    return "C"
  elif int(Dlq_stat) <= 3:
    return "D"
  elif float(Zb_code)== 1 :
      return "P"
  else:
      return "S"

In [8]:
print(frame, '\n')
frame['cur_state'] = frame.apply(lambda x: generate_cur(x.Dlq_stat, x.Zb_code), axis = 1)
print(frame)

  Loan_id  Act_date Dlq_stat Zb_code
0       1  3/1/2008        0     nan
1       1  4/1/2008        1     nan
2       1  5/1/2008        2     nan
3       2  3/1/2008        3     nan
4       2  4/1/2008        4     nan
5       2  5/1/2008      999     1.0

  Loan_id  Act_date Dlq_stat Zb_code cur_state
0       1  3/1/2008        0     nan         C
1       1  4/1/2008        1     nan         D
2       1  5/1/2008        2     nan         D
3       2  3/1/2008        3     nan         D
4       2  4/1/2008        4     nan         S
5       2  5/1/2008      999     1.0         P

In [10]:

#create next state
next_state=[None]*len(frame.Loan_id)

cur_state = list(frame.cur_state)
print(cur_state)
print(next_state)

['C', 'D', 'D', 'D', 'S', 'P']
[None, None, None, None, None, None]

In [11]:
listids = list(frame.Loan_id)
unique =set(frame.Loan_id)
print(unique)

{'2', '1'}

In [12]:
for loan in unique:
  indexPosList = [ i for i in range(len(listids)) if listids[i] == loan ]
    # print(indexPosList)
  indexPosList.pop()
  for j in indexPosList:
    next_state[j]=cur_state[j+1]
print(next_state)

['D', 'D', None, 'S', 'P', None]

In [13]:
frame['next_state']=next_state
print(frame)

  Loan_id  Act_date Dlq_stat Zb_code cur_state next_state
0       1  3/1/2008        0     nan         C          D
1       1  4/1/2008        1     nan         D          D
2       1  5/1/2008        2     nan         D       None
3       2  3/1/2008        3     nan         D          S
4       2  4/1/2008        4     nan         S          P
5       2  5/1/2008      999     1.0         P       None